### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.dev.google_app_engine_standard_app_version.fmltc-app-v1 will be updated in-place
!   resource "google_app_engine_standard_app_version" "fmltc-app-v1" {
!       env_variables             = {
!           "ORIGIN"        = "https://ftc-ml.gcp-dev.ftclive.org" -> "ftc-ml-dev.firstinspires.org"
            # (3 unchanged elements hidden)
        }
        id                        = "apps/ftc-ml-firstinspires-dev/services/default/versions/v1"
        name                      = "apps/ftc-ml-firstinspires-dev/services/default/versions/v1"
        # (8 unchanged attributes hidden)


!       deployment {

!           zip {
!               source_url  = "https://storage.googleapis.com/ftc-ml-firstinspires-dev-gae-source/8b0940d1a98a81246092446b01c243fc.zip" -> "https://storage.googleapis.com/ftc-ml-firstinspires-dev-gae-source/3b8fa15d63f173be83053c6ffe21036a.zip"
                # (1 unchanged attribute hidden)
            }
        }


-       handlers {
-           auth_fail_action = "AUTH_FAIL_ACTION_REDIRECT" -> null
-           login            = "LOGIN_OPTIONAL" -> null
-           security_level   = "SECURE_OPTIONAL" -> null
-           url_regex        = ".*" -> null

-           script {
-               script_path = "auto" -> null
            }
        }


        # (8 unchanged blocks hidden)
    }

  # module.dev.google_cloudfunctions_function.frame-extraction will be updated in-place
!   resource "google_cloudfunctions_function" "frame-extraction" {
        id                    = "projects/ftc-ml-firstinspires-dev/locations/us-central1/functions/perform_action"
        name                  = "perform_action"
!       source_archive_object = "5cf3505186e65f3f8ebeebf3004e5fb6.zip" -> "59b57ab35954b17ad1a63af9600ab305.zip"
        # (13 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.dev.google_storage_bucket_object.app-server-archive must be replaced
-/+ resource "google_storage_bucket_object" "app-server-archive" {
!       content_type     = "application/zip" -> (known after apply)
!       crc32c           = "a/CDvw==" -> (known after apply)
!       detect_md5hash   = "iwlA0amKgSRgkkRrAcJD/A==" -> "different hash" # forces replacement
-       event_based_hold = false -> null
!       id               = "ftc-ml-firstinspires-dev-gae-source-8b0940d1a98a81246092446b01c243fc.zip" -> (known after apply)
+       kms_key_name     = (known after apply)
!       md5hash          = "iwlA0amKgSRgkkRrAcJD/A==" -> (known after apply)
!       media_link       = "https://storage.googleapis.com/download/storage/v1/b/ftc-ml-firstinspires-dev-gae-source/o/8b0940d1a98a81246092446b01c243fc.zip?generation=1633115126063217&alt=media" -> (known after apply)
-       metadata         = {} -> null
!       name             = "8b0940d1a98a81246092446b01c243fc.zip" -> "3b8fa15d63f173be83053c6ffe21036a.zip" # forces replacement
!       output_name      = "8b0940d1a98a81246092446b01c243fc.zip" -> (known after apply)
!       self_link        = "https://www.googleapis.com/storage/v1/b/ftc-ml-firstinspires-dev-gae-source/o/8b0940d1a98a81246092446b01c243fc.zip" -> (known after apply)
!       storage_class    = "STANDARD" -> (known after apply)
-       temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

  # module.dev.google_storage_bucket_object.cloud-function-archive must be replaced
-/+ resource "google_storage_bucket_object" "cloud-function-archive" {
!       content_type     = "application/zip" -> (known after apply)
!       crc32c           = "H+gMSg==" -> (known after apply)
!       detect_md5hash   = "XPNQUYbmXz+OvuvzAE5ftg==" -> "different hash" # forces replacement
-       event_based_hold = false -> null
!       id               = "ftc-ml-firstinspires-dev-gcf-source-5cf3505186e65f3f8ebeebf3004e5fb6.zip" -> (known after apply)
+       kms_key_name     = (known after apply)
!       md5hash          = "XPNQUYbmXz+OvuvzAE5ftg==" -> (known after apply)
!       media_link       = "https://storage.googleapis.com/download/storage/v1/b/ftc-ml-firstinspires-dev-gcf-source/o/5cf3505186e65f3f8ebeebf3004e5fb6.zip?generation=1633115125984197&alt=media" -> (known after apply)
-       metadata         = {} -> null
!       name             = "5cf3505186e65f3f8ebeebf3004e5fb6.zip" -> "59b57ab35954b17ad1a63af9600ab305.zip" # forces replacement
!       output_name      = "5cf3505186e65f3f8ebeebf3004e5fb6.zip" -> (known after apply)
!       self_link        = "https://www.googleapis.com/storage/v1/b/ftc-ml-firstinspires-dev-gcf-source/o/5cf3505186e65f3f8ebeebf3004e5fb6.zip" -> (known after apply)
!       storage_class    = "STANDARD" -> (known after apply)
-       temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```
</details>